function loadTestDataButtonFunction() {
  if (Object.keys(dataInputArr).length == 0) {
    let name_arr = ["南白糸台小", "警察学校", "府中第六中", "府中第四小", "飛田給小", "府中第二中", "石原小"];
    // let place_arr = [
    //   [random(0, 30), random(0, 30), random(0, 30), random(0, 30), random(0, 30), random(0, 30), random(0, 30)],
    //   [random(0, 30), random(0, 30), random(0, 30), random(0, 30), random(0, 30), random(0, 30), random(0, 30)],
    // ];
    let place_arr = [
      [35.660552, 35.668404, 35.660752, 35.666669, 35.654647, 35.672779, 35.660607],
      [139.516632, 139.519548, 139.507364, 139.507854, 139.523045, 139.508945, 139.538435],
    ];
    let test_data = {
      // "砂岩層","泥岩層","れき岩層","石灰岩層","凝灰岩層・火山灰層","ローム層","その他の層"
      // のいずれかから選択
      地点1: [
        // [-53, -36, "その他の層"],
        [-36, -35, "その他の層"],
        [-35, -34, "ローム層"],
        [-34, -29, "れき岩層"],
        [-29, -25, "砂岩層"],
      ],
      地点2: [
        // [-53, -46, "その他の層"],
        [-46, -44, "その他の層"],
        [-44, -42, "ローム層"],
        [-42, -37, "れき岩層"],
      ],
      地点3: [
        // [-53, -39, "その他の層"],
        [-39, -38, "その他の層"],
        [-38, -35, "ローム層"],
        [-35, -27, "れき岩層"],
      ],
      地点4: [
        // [-53, -50, "その他の層"],
        [-50, -49, "その他の層"],
        [-49, -48, "ローム層"],
        [-48, -44, "れき岩層"],
        [-44, -41, "砂岩層"],
        [-41, -37, "泥岩層"],
      ],
      地点5: [
        // [-53, -35, "その他の層"],
        [-35, -34, "その他の層"],
        [-34, -28, "れき岩層"],
      ],
      地点6: [
        // [-53, -49, "その他の層"],
        [-49, -48, "その他の層"],
        [-48, -45, "ローム層"],
        [-45, -38, "れき岩層"],
      ],
      地点7: [
        // [-53, -40, "その他の層"],
        [-40, -39, "その他の層"],
        [-39, -36, "ローム層"],
        [-36, -32, "れき岩層"],
        [-32, -28, "泥岩層"],
      ],
    };
    for (let i = 0; i < name_arr.length; i++) {
      placeAddButtonFunction();
      let el = document.getElementById("placeNameInput" + (i + 1));
      let pa1 = el.children[0];
      let pl = pa1.children[1];
      pl.value = name_arr[i];
      let pa2 = el.children[1];
      let vl = pa2.children;
      vl[1].value = place_arr[0][i];
      vl[3].value = place_arr[1][i];
      dataInputArr["地点" + (i + 1)].layer = test_data["地点" + (i + 1)];
    }
    placeNameInputFunction();
  }
}
